; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Hanoi Tower
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(define (domain HANOI)
	(:requirements :strips :typing :negative-preconditions)
	(:types disk case)
	(:predicates
		(on_disk ?d1 - disk ?d2 - disk)
		(bigger ?d1 - disk ?d2 - disk)
		(on_case ?d1 - disk ?c - case)
		(clear_disk ?d - disk)
		(clear_case ?c - case)
		(handempty)
		(holding ?d - disk)
	)

	(:action pick_up
		 :parameters (?d - disk ?c - case)
	     	 :precondition (and (clear_disk ?d) (on_case ?d ?c) (handempty))
	     	 :effect
	     	 (and (not (on_case ?d ?c))
		      (clear_case ?c)
		      (not (clear_disk ?d))
		      (not (handempty))
		      (holding ?d)
		 )
	)
	(:action unstack
 		 :parameters (?d - disk ?d2 - disk)
	     	 :precondition (and (clear_disk ?d) (on_disk ?d ?d2) (handempty))
	     	 :effect
	     	 (and (not (on_disk ?d ?d2))
		      (not (clear_disk ?d))
		      	   (clear_disk ?d2)
		      (not (handempty))
		      (holding ?d)
		 )
	)

	(:action put_down
		 :parameters (?d - disk ?c - case)
		 :precondition (and (clear_case ?c) (holding ?d) )
		 :effect
		 (and (not (clear_case ?c))
		      (not (holding ?d))
		      (clear_disk ?d)
		      (on_case ?d ?c)
		      (handempty)
		 )
	)

	(:action stack
		 :parameters (?d1 - disk ?d2 - disk)
		 :precondition (and (clear_disk ?d2) (holding ?d1) (bigger ?d2 ?d1))
		 :effect
		 (and (not (clear_disk ?d2))
		      (not (holding ?d1))
		      (on_disk ?d1 ?d2)
		      (clear_disk ?d1)
		      (handempty)
		 )
	)
)

; problem
(define (problem HANOI_16)
(:domain HANOI)
(:objects D1 D2 D3 D4 D5 D6 D7 D8 D9 D10 - disk
	  C1 C2 C3 - case
)
(:init
    (handempty)

    (bigger D1 D2)
    (bigger D1 D3)
    (bigger D1 D4)
    (bigger D1 D5)
    (bigger D1 D6)
    (bigger D1 D7)
    (bigger D1 D8)
    (bigger D1 D9)
    (bigger D1 D10)
    (bigger D2 D3)
    (bigger D2 D4)
    (bigger D2 D5)
    (bigger D2 D6)
    (bigger D2 D7)
    (bigger D2 D8)
    (bigger D2 D9)
    (bigger D2 D10)
    (bigger D3 D4)
    (bigger D3 D5)
    (bigger D3 D5)
    (bigger D3 D6)
    (bigger D3 D7)
    (bigger D3 D8)
    (bigger D3 D9)
    (bigger D3 D10)
    (bigger D4 D5)
    (bigger D4 D6)
    (bigger D4 D7)
    (bigger D4 D8)
    (bigger D4 D9)
    (bigger D4 D10)
    (bigger D5 D6)
    (bigger D5 D7)
    (bigger D5 D8)
    (bigger D5 D9)
    (bigger D5 D10)
    (bigger D6 D7)
    (bigger D6 D8)
    (bigger D6 D9)
    (bigger D6 D10)
    (bigger D7 D8)
    (bigger D7 D9)
    (bigger D7 D10)
    (bigger D8 D9)
    (bigger D8 D10)
    (bigger D9 D10)
    
    (on_case D1 C1)
    (on_disk D2 D1)
    (on_disk D3 D2)
    (on_disk D4 D3)
    (on_disk D5 D4)
    (on_disk D6 D5)
    (on_disk D7 D6)
    (on_disk D8 D7)
    (on_disk D9 D8)
    (on_disk D10 D9)
    (clear_disk D10)
    (clear_case C2)
    (clear_case C3)

)
(:goal
	(and
        (on_case D1 C1)
        (on_case D5 C2)
        
        (on_disk D2 D1)
        (on_disk D6 D5)

        (on_disk D3 D2)
        (on_disk D7 D6)
        
        (on_disk D4 D3)
        (on_disk D8 D7)
        
        (on_disk D9 D8)
        (on_disk D10 D9)
        
	(handempty)
	)
))

; plan
1. (unstack d10 d9)
   deleted: (on_disk d10 d9) (clear_disk d10) (handempty)
   added: (clear_disk d9) (holding d10)
   goals met: 8 of 11
2. (put_down d10 c3)
   deleted: (clear_case c3) (holding d10)
   added: (clear_disk d10) (on_case d10 c3) (handempty)
   goals met: 9 of 11
3. (unstack d9 d8)
   deleted: (on_disk d9 d8) (clear_disk d9) (handempty)
   added: (clear_disk d8) (holding d9)
   goals met: 7 of 11
4. (put_down d9 c2)
   deleted: (clear_case c2) (holding d9)
   added: (clear_disk d9) (on_case d9 c2) (handempty)
   goals met: 8 of 11
5. (pick_up d10 c3)
   deleted: (on_case d10 c3) (clear_disk d10) (handempty)
   added: (clear_case c3) (holding d10)
   goals met: 7 of 11
6. (stack d10 d9)
   deleted: (clear_disk d9) (holding d10)
   added: (on_disk d10 d9) (clear_disk d10) (handempty)
   goals met: 9 of 11
7. (unstack d8 d7)
   deleted: (on_disk d8 d7) (clear_disk d8) (handempty)
   added: (clear_disk d7) (holding d8)
   goals met: 7 of 11
8. (put_down d8 c3)
   deleted: (clear_case c3) (holding d8)
   added: (clear_disk d8) (on_case d8 c3) (handempty)
   goals met: 8 of 11
9. (unstack d10 d9)
   deleted: (on_disk d10 d9) (clear_disk d10) (handempty)
   added: (clear_disk d9) (holding d10)
   goals met: 6 of 11
10. (stack d10 d7)
   deleted: (clear_disk d7) (holding d10)
   added: (on_disk d10 d7) (clear_disk d10) (handempty)
   goals met: 7 of 11
11. (pick_up d9 c2)
   deleted: (on_case d9 c2) (clear_disk d9) (handempty)
   added: (clear_case c2) (holding d9)
   goals met: 6 of 11
12. (stack d9 d8)
   deleted: (clear_disk d8) (holding d9)
   added: (on_disk d9 d8) (clear_disk d9) (handempty)
   goals met: 8 of 11
13. (unstack d10 d7)
   deleted: (on_disk d10 d7) (clear_disk d10) (handempty)
   added: (clear_disk d7) (holding d10)
   goals met: 7 of 11
14. (stack d10 d9)
   deleted: (clear_disk d9) (holding d10)
   added: (on_disk d10 d9) (clear_disk d10) (handempty)
   goals met: 9 of 11
15. (unstack d7 d6)
   deleted: (on_disk d7 d6) (clear_disk d7) (handempty)
   added: (clear_disk d6) (holding d7)
   goals met: 7 of 11
16. (put_down d7 c2)
   deleted: (clear_case c2) (holding d7)
   added: (clear_disk d7) (on_case d7 c2) (handempty)
   goals met: 8 of 11
17. (unstack d10 d9)
   deleted: (on_disk d10 d9) (clear_disk d10) (handempty)
   added: (clear_disk d9) (holding d10)
   goals met: 6 of 11
18. (stack d10 d7)
   deleted: (clear_disk d7) (holding d10)
   added: (on_disk d10 d7) (clear_disk d10) (handempty)
   goals met: 7 of 11
19. (unstack d9 d8)
   deleted: (on_disk d9 d8) (clear_disk d9) (handempty)
   added: (clear_disk d8) (holding d9)
   goals met: 5 of 11
20. (stack d9 d6)
   deleted: (clear_disk d6) (holding d9)
   added: (on_disk d9 d6) (clear_disk d9) (handempty)
   goals met: 6 of 11
21. (unstack d10 d7)
   deleted: (on_disk d10 d7) (clear_disk d10) (handempty)
   added: (clear_disk d7) (holding d10)
   goals met: 5 of 11
22. (stack d10 d9)
   deleted: (clear_disk d9) (holding d10)
   added: (on_disk d10 d9) (clear_disk d10) (handempty)
   goals met: 7 of 11
23. (pick_up d8 c3)
   deleted: (on_case d8 c3) (clear_disk d8) (handempty)
   added: (clear_case c3) (holding d8)
   goals met: 6 of 11
24. (stack d8 d7)
   deleted: (clear_disk d7) (holding d8)
   added: (on_disk d8 d7) (clear_disk d8) (handempty)
   goals met: 8 of 11
25. (unstack d10 d9)
   deleted: (on_disk d10 d9) (clear_disk d10) (handempty)
   added: (clear_disk d9) (holding d10)
   goals met: 6 of 11
26. (put_down d10 c3)
   deleted: (clear_case c3) (holding d10)
   added: (clear_disk d10) (on_case d10 c3) (handempty)
   goals met: 7 of 11
27. (unstack d9 d6)
   deleted: (on_disk d9 d6) (clear_disk d9) (handempty)
   added: (clear_disk d6) (holding d9)
   goals met: 6 of 11
28. (stack d9 d8)
   deleted: (clear_disk d8) (holding d9)
   added: (on_disk d9 d8) (clear_disk d9) (handempty)
   goals met: 8 of 11
29. (pick_up d10 c3)
   deleted: (on_case d10 c3) (clear_disk d10) (handempty)
   added: (clear_case c3) (holding d10)
   goals met: 7 of 11
30. (stack d10 d9)
   deleted: (clear_disk d9) (holding d10)
   added: (on_disk d10 d9) (clear_disk d10) (handempty)
   goals met: 9 of 11
31. (unstack d6 d5)
   deleted: (on_disk d6 d5) (clear_disk d6) (handempty)
   added: (clear_disk d5) (holding d6)
   goals met: 7 of 11
32. (put_down d6 c3)
   deleted: (clear_case c3) (holding d6)
   added: (clear_disk d6) (on_case d6 c3) (handempty)
   goals met: 8 of 11
33. (unstack d10 d9)
   deleted: (on_disk d10 d9) (clear_disk d10) (handempty)
   added: (clear_disk d9) (holding d10)
   goals met: 6 of 11
34. (stack d10 d5)
   deleted: (clear_disk d5) (holding d10)
   added: (on_disk d10 d5) (clear_disk d10) (handempty)
   goals met: 7 of 11
35. (unstack d9 d8)
   deleted: (on_disk d9 d8) (clear_disk d9) (handempty)
   added: (clear_disk d8) (holding d9)
   goals met: 5 of 11
36. (stack d9 d6)
   deleted: (clear_disk d6) (holding d9)
   added: (on_disk d9 d6) (clear_disk d9) (handempty)
   goals met: 6 of 11
37. (unstack d10 d5)
   deleted: (on_disk d10 d5) (clear_disk d10) (handempty)
   added: (clear_disk d5) (holding d10)
   goals met: 5 of 11
38. (stack d10 d9)
   deleted: (clear_disk d9) (holding d10)
   added: (on_disk d10 d9) (clear_disk d10) (handempty)
   goals met: 7 of 11
39. (unstack d8 d7)
   deleted: (on_disk d8 d7) (clear_disk d8) (handempty)
   added: (clear_disk d7) (holding d8)
   goals met: 5 of 11
40. (stack d8 d5)
   deleted: (clear_disk d5) (holding d8)
   added: (on_disk d8 d5) (clear_disk d8) (handempty)
   goals met: 6 of 11
41. (unstack d10 d9)
   deleted: (on_disk d10 d9) (clear_disk d10) (handempty)
   added: (clear_disk d9) (holding d10)
   goals met: 4 of 11
42. (stack d10 d7)
   deleted: (clear_disk d7) (holding d10)
   added: (on_disk d10 d7) (clear_disk d10) (handempty)
   goals met: 5 of 11
43. (unstack d9 d6)
   deleted: (on_disk d9 d6) (clear_disk d9) (handempty)
   added: (clear_disk d6) (holding d9)
   goals met: 4 of 11
44. (stack d9 d8)
   deleted: (clear_disk d8) (holding d9)
   added: (on_disk d9 d8) (clear_disk d9) (handempty)
   goals met: 6 of 11
45. (unstack d10 d7)
   deleted: (on_disk d10 d7) (clear_disk d10) (handempty)
   added: (clear_disk d7) (holding d10)
   goals met: 5 of 11
46. (stack d10 d9)
   deleted: (clear_disk d9) (holding d10)
   added: (on_disk d10 d9) (clear_disk d10) (handempty)
   goals met: 7 of 11
47. (pick_up d7 c2)
   deleted: (on_case d7 c2) (clear_disk d7) (handempty)
   added: (clear_case c2) (holding d7)
   goals met: 6 of 11
48. (stack d7 d6)
   deleted: (clear_disk d6) (holding d7)
   added: (on_disk d7 d6) (clear_disk d7) (handempty)
   goals met: 8 of 11
49. (unstack d10 d9)
   deleted: (on_disk d10 d9) (clear_disk d10) (handempty)
   added: (clear_disk d9) (holding d10)
   goals met: 6 of 11
50. (stack d10 d7)
   deleted: (clear_disk d7) (holding d10)
   added: (on_disk d10 d7) (clear_disk d10) (handempty)
   goals met: 7 of 11
51. (unstack d9 d8)
   deleted: (on_disk d9 d8) (clear_disk d9) (handempty)
   added: (clear_disk d8) (holding d9)
   goals met: 5 of 11
52. (put_down d9 c2)
   deleted: (clear_case c2) (holding d9)
   added: (clear_disk d9) (on_case d9 c2) (handempty)
   goals met: 6 of 11
53. (unstack d10 d7)
   deleted: (on_disk d10 d7) (clear_disk d10) (handempty)
   added: (clear_disk d7) (holding d10)
   goals met: 5 of 11
54. (stack d10 d9)
   deleted: (clear_disk d9) (holding d10)
   added: (on_disk d10 d9) (clear_disk d10) (handempty)
   goals met: 7 of 11
55. (unstack d8 d5)
   deleted: (on_disk d8 d5) (clear_disk d8) (handempty)
   added: (clear_disk d5) (holding d8)
   goals met: 6 of 11
56. (stack d8 d7)
   deleted: (clear_disk d7) (holding d8)
   added: (on_disk d8 d7) (clear_disk d8) (handempty)
   goals met: 8 of 11
57. (unstack d10 d9)
   deleted: (on_disk d10 d9) (clear_disk d10) (handempty)
   added: (clear_disk d9) (holding d10)
   goals met: 6 of 11
58. (stack d10 d5)
   deleted: (clear_disk d5) (holding d10)
   added: (on_disk d10 d5) (clear_disk d10) (handempty)
   goals met: 7 of 11
59. (pick_up d9 c2)
   deleted: (on_case d9 c2) (clear_disk d9) (handempty)
   added: (clear_case c2) (holding d9)
   goals met: 6 of 11
60. (stack d9 d8)
   deleted: (clear_disk d8) (holding d9)
   added: (on_disk d9 d8) (clear_disk d9) (handempty)
   goals met: 8 of 11
61. (unstack d10 d5)
   deleted: (on_disk d10 d5) (clear_disk d10) (handempty)
   added: (clear_disk d5) (holding d10)
   goals met: 7 of 11
62. (stack d10 d9)
   deleted: (clear_disk d9) (holding d10)
   added: (on_disk d10 d9) (clear_disk d10) (handempty)
   goals met: 9 of 11
63. (unstack d5 d4)
   deleted: (on_disk d5 d4) (clear_disk d5) (handempty)
   added: (clear_disk d4) (holding d5)
   goals met: 8 of 11
64. (put_down d5 c2)
   deleted: (clear_case c2) (holding d5)
   added: (clear_disk d5) (on_case d5 c2) (handempty)
   goals met: 10 of 11
65. (unstack d10 d9)
   deleted: (on_disk d10 d9) (clear_disk d10) (handempty)
   added: (clear_disk d9) (holding d10)
   goals met: 8 of 11
66. (stack d10 d4)
   deleted: (clear_disk d4) (holding d10)
   added: (on_disk d10 d4) (clear_disk d10) (handempty)
   goals met: 9 of 11
67. (unstack d9 d8)
   deleted: (on_disk d9 d8) (clear_disk d9) (handempty)
   added: (clear_disk d8) (holding d9)
   goals met: 7 of 11
68. (stack d9 d5)
   deleted: (clear_disk d5) (holding d9)
   added: (on_disk d9 d5) (clear_disk d9) (handempty)
   goals met: 8 of 11
69. (unstack d10 d4)
   deleted: (on_disk d10 d4) (clear_disk d10) (handempty)
   added: (clear_disk d4) (holding d10)
   goals met: 7 of 11
70. (stack d10 d9)
   deleted: (clear_disk d9) (holding d10)
   added: (on_disk d10 d9) (clear_disk d10) (handempty)
   goals met: 9 of 11
71. (unstack d8 d7)
   deleted: (on_disk d8 d7) (clear_disk d8) (handempty)
   added: (clear_disk d7) (holding d8)
   goals met: 7 of 11
72. (stack d8 d4)
   deleted: (clear_disk d4) (holding d8)
   added: (on_disk d8 d4) (clear_disk d8) (handempty)
   goals met: 8 of 11
73. (unstack d10 d9)
   deleted: (on_disk d10 d9) (clear_disk d10) (handempty)
   added: (clear_disk d9) (holding d10)
   goals met: 6 of 11
74. (stack d10 d8)
   deleted: (clear_disk d8) (holding d10)
   added: (on_disk d10 d8) (clear_disk d10) (handempty)
   goals met: 7 of 11
75. (unstack d9 d5)
   deleted: (on_disk d9 d5) (clear_disk d9) (handempty)
   added: (clear_disk d5) (holding d9)
   goals met: 6 of 11
76. (stack d9 d7)
   deleted: (clear_disk d7) (holding d9)
   added: (on_disk d9 d7) (clear_disk d9) (handempty)
   goals met: 7 of 11
77. (unstack d10 d8)
   deleted: (on_disk d10 d8) (clear_disk d10) (handempty)
   added: (clear_disk d8) (holding d10)
   goals met: 6 of 11
78. (stack d10 d9)
   deleted: (clear_disk d9) (holding d10)
   added: (on_disk d10 d9) (clear_disk d10) (handempty)
   goals met: 8 of 11
79. (unstack d8 d4)
   deleted: (on_disk d8 d4) (clear_disk d8) (handempty)
   added: (clear_disk d4) (holding d8)
   goals met: 7 of 11
80. (stack d8 d5)
   deleted: (clear_disk d5) (holding d8)
   added: (on_disk d8 d5) (clear_disk d8) (handempty)
   goals met: 8 of 11
81. (unstack d10 d9)
   deleted: (on_disk d10 d9) (clear_disk d10) (handempty)
   added: (clear_disk d9) (holding d10)
   goals met: 6 of 11
82. (stack d10 d4)
   deleted: (clear_disk d4) (holding d10)
   added: (on_disk d10 d4) (clear_disk d10) (handempty)
   goals met: 7 of 11
83. (unstack d9 d7)
   deleted: (on_disk d9 d7) (clear_disk d9) (handempty)
   added: (clear_disk d7) (holding d9)
   goals met: 6 of 11
84. (stack d9 d8)
   deleted: (clear_disk d8) (holding d9)
   added: (on_disk d9 d8) (clear_disk d9) (handempty)
   goals met: 8 of 11
85. (unstack d10 d4)
   deleted: (on_disk d10 d4) (clear_disk d10) (handempty)
   added: (clear_disk d4) (holding d10)
   goals met: 7 of 11
86. (stack d10 d9)
   deleted: (clear_disk d9) (holding d10)
   added: (on_disk d10 d9) (clear_disk d10) (handempty)
   goals met: 9 of 11
87. (unstack d7 d6)
   deleted: (on_disk d7 d6) (clear_disk d7) (handempty)
   added: (clear_disk d6) (holding d7)
   goals met: 7 of 11
88. (stack d7 d4)
   deleted: (clear_disk d4) (holding d7)
   added: (on_disk d7 d4) (clear_disk d7) (handempty)
   goals met: 8 of 11
89. (unstack d10 d9)
   deleted: (on_disk d10 d9) (clear_disk d10) (handempty)
   added: (clear_disk d9) (holding d10)
   goals met: 6 of 11
90. (stack d10 d7)
   deleted: (clear_disk d7) (holding d10)
   added: (on_disk d10 d7) (clear_disk d10) (handempty)
   goals met: 7 of 11
91. (unstack d9 d8)
   deleted: (on_disk d9 d8) (clear_disk d9) (handempty)
   added: (clear_disk d8) (holding d9)
   goals met: 5 of 11
92. (stack d9 d6)
   deleted: (clear_disk d6) (holding d9)
   added: (on_disk d9 d6) (clear_disk d9) (handempty)
   goals met: 6 of 11
93. (unstack d10 d7)
   deleted: (on_disk d10 d7) (clear_disk d10) (handempty)
   added: (clear_disk d7) (holding d10)
   goals met: 5 of 11
94. (stack d10 d9)
   deleted: (clear_disk d9) (holding d10)
   added: (on_disk d10 d9) (clear_disk d10) (handempty)
   goals met: 7 of 11
95. (unstack d8 d5)
   deleted: (on_disk d8 d5) (clear_disk d8) (handempty)
   added: (clear_disk d5) (holding d8)
   goals met: 6 of 11
96. (stack d8 d7)
   deleted: (clear_disk d7) (holding d8)
   added: (on_disk d8 d7) (clear_disk d8) (handempty)
   goals met: 8 of 11
97. (unstack d10 d9)
   deleted: (on_disk d10 d9) (clear_disk d10) (handempty)
   added: (clear_disk d9) (holding d10)
   goals met: 6 of 11
98. (stack d10 d5)
   deleted: (clear_disk d5) (holding d10)
   added: (on_disk d10 d5) (clear_disk d10) (handempty)
   goals met: 7 of 11
99. (unstack d9 d6)
   deleted: (on_disk d9 d6) (clear_disk d9) (handempty)
   added: (clear_disk d6) (holding d9)
   goals met: 6 of 11
100. (stack d9 d8)
   deleted: (clear_disk d8) (holding d9)
   added: (on_disk d9 d8) (clear_disk d9) (handempty)
   goals met: 8 of 11
101. (unstack d10 d5)
   deleted: (on_disk d10 d5) (clear_disk d10) (handempty)
   added: (clear_disk d5) (holding d10)
   goals met: 7 of 11
102. (stack d10 d9)
   deleted: (clear_disk d9) (holding d10)
   added: (on_disk d10 d9) (clear_disk d10) (handempty)
   goals met: 9 of 11
103. (pick_up d6 c3)
   deleted: (on_case d6 c3) (clear_disk d6) (handempty)
   added: (clear_case c3) (holding d6)
   goals met: 8 of 11
104. (stack d6 d5)
   deleted: (clear_disk d5) (holding d6)
   added: (on_disk d6 d5) (clear_disk d6) (handempty)
   goals met: 10 of 11
105. (unstack d10 d9)
   deleted: (on_disk d10 d9) (clear_disk d10) (handempty)
   added: (clear_disk d9) (holding d10)
   goals met: 8 of 11
106. (put_down d10 c3)
   deleted: (clear_case c3) (holding d10)
   added: (clear_disk d10) (on_case d10 c3) (handempty)
   goals met: 9 of 11
107. (unstack d9 d8)
   deleted: (on_disk d9 d8) (clear_disk d9) (handempty)
   added: (clear_disk d8) (holding d9)
   goals met: 7 of 11
108. (stack d9 d6)
   deleted: (clear_disk d6) (holding d9)
   added: (on_disk d9 d6) (clear_disk d9) (handempty)
   goals met: 8 of 11
109. (pick_up d10 c3)
   deleted: (on_case d10 c3) (clear_disk d10) (handempty)
   added: (clear_case c3) (holding d10)
   goals met: 7 of 11
110. (stack d10 d9)
   deleted: (clear_disk d9) (holding d10)
   added: (on_disk d10 d9) (clear_disk d10) (handempty)
   goals met: 9 of 11
111. (unstack d8 d7)
   deleted: (on_disk d8 d7) (clear_disk d8) (handempty)
   added: (clear_disk d7) (holding d8)
   goals met: 7 of 11
112. (put_down d8 c3)
   deleted: (clear_case c3) (holding d8)
   added: (clear_disk d8) (on_case d8 c3) (handempty)
   goals met: 8 of 11
113. (unstack d10 d9)
   deleted: (on_disk d10 d9) (clear_disk d10) (handempty)
   added: (clear_disk d9) (holding d10)
   goals met: 6 of 11
114. (stack d10 d7)
   deleted: (clear_disk d7) (holding d10)
   added: (on_disk d10 d7) (clear_disk d10) (handempty)
   goals met: 7 of 11
115. (unstack d9 d6)
   deleted: (on_disk d9 d6) (clear_disk d9) (handempty)
   added: (clear_disk d6) (holding d9)
   goals met: 6 of 11
116. (stack d9 d8)
   deleted: (clear_disk d8) (holding d9)
   added: (on_disk d9 d8) (clear_disk d9) (handempty)
   goals met: 8 of 11
117. (unstack d10 d7)
   deleted: (on_disk d10 d7) (clear_disk d10) (handempty)
   added: (clear_disk d7) (holding d10)
   goals met: 7 of 11
118. (stack d10 d9)
   deleted: (clear_disk d9) (holding d10)
   added: (on_disk d10 d9) (clear_disk d10) (handempty)
   goals met: 9 of 11
119. (unstack d7 d4)
   deleted: (on_disk d7 d4) (clear_disk d7) (handempty)
   added: (clear_disk d4) (holding d7)
   goals met: 8 of 11
120. (stack d7 d6)
   deleted: (clear_disk d6) (holding d7)
   added: (on_disk d7 d6) (clear_disk d7) (handempty)
   goals met: 10 of 11
121. (unstack d10 d9)
   deleted: (on_disk d10 d9) (clear_disk d10) (handempty)
   added: (clear_disk d9) (holding d10)
   goals met: 8 of 11
122. (stack d10 d7)
   deleted: (clear_disk d7) (holding d10)
   added: (on_disk d10 d7) (clear_disk d10) (handempty)
   goals met: 9 of 11
123. (unstack d9 d8)
   deleted: (on_disk d9 d8) (clear_disk d9) (handempty)
   added: (clear_disk d8) (holding d9)
   goals met: 7 of 11
124. (stack d9 d4)
   deleted: (clear_disk d4) (holding d9)
   added: (on_disk d9 d4) (clear_disk d9) (handempty)
   goals met: 8 of 11
125. (unstack d10 d7)
   deleted: (on_disk d10 d7) (clear_disk d10) (handempty)
   added: (clear_disk d7) (holding d10)
   goals met: 7 of 11
126. (stack d10 d9)
   deleted: (clear_disk d9) (holding d10)
   added: (on_disk d10 d9) (clear_disk d10) (handempty)
   goals met: 9 of 11
127. (pick_up d8 c3)
   deleted: (on_case d8 c3) (clear_disk d8) (handempty)
   added: (clear_case c3) (holding d8)
   goals met: 8 of 11
128. (stack d8 d7)
   deleted: (clear_disk d7) (holding d8)
   added: (on_disk d8 d7) (clear_disk d8) (handempty)
   goals met: 10 of 11
129. (unstack d10 d9)
   deleted: (on_disk d10 d9) (clear_disk d10) (handempty)
   added: (clear_disk d9) (holding d10)
   goals met: 8 of 11
130. (put_down d10 c3)
   deleted: (clear_case c3) (holding d10)
   added: (clear_disk d10) (on_case d10 c3) (handempty)
   goals met: 9 of 11
131. (unstack d9 d4)
   deleted: (on_disk d9 d4) (clear_disk d9) (handempty)
   added: (clear_disk d4) (holding d9)
   goals met: 8 of 11
132. (stack d9 d8)
   deleted: (clear_disk d8) (holding d9)
   added: (on_disk d9 d8) (clear_disk d9) (handempty)
   goals met: 10 of 11
133. (pick_up d10 c3)
   deleted: (on_case d10 c3) (clear_disk d10) (handempty)
   added: (clear_case c3) (holding d10)
   goals met: 9 of 11
134. (stack d10 d9)
   deleted: (clear_disk d9) (holding d10)
   added: (on_disk d10 d9) (clear_disk d10) (handempty)
   goals met: 11 of 11
